---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ValidateCurveLoopsOptions Properties
ValidateCurveLoopsOptions Class See Also Send Feedback
---

The ValidateCurveLoopsOptions type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ValidateCurveLoopsOptions Class

Autodesk.Revit.DB Namespace